size(700,700);
background(245,236,0);

//線
//line(100,0,100,800);
//line(200,0,200,800);
//line(300,0,300,800);
//line(400,0,400,800);
//line(500,0,500,800);
//line(600,0,600,800);
//line(700,0,700,800);

//line(0,100,800,100);
//line(0,200,800,200);
//line(0,300,800,300);
//line(0,400,800,400);
//line(0,500,800,500);
//line(0,600,800,600);
//line(0,700,800,700);




//青丸
stroke(0);
fill(101,130,255);
ellipse(300,300,360,340);

//顔白
stroke(0);
fill(255);
ellipse(300,340,310,260);

//白目
fill(255);
ellipse(260,210,80,100);
ellipse(340,210,80,100);

//黒目
//fill(0);
//ellipse(280,220,30,40);
//ellipse(320,220,30,40);

//目光
//fill(255);
//ellipse(285,220,10,15);
//ellipse(315,220,10,15);


//にこ目頭
stroke(0);
noFill();
arc(270,230,40,35,radians(180),radians(360));
arc(330,230,40,35,radians(180),radians(360));




//赤鼻
fill(255,0,0);
ellipse(300,250,35,35);

//鼻光
noStroke();
fill(255);
ellipse(295,245,15,15);

//鼻下
stroke(0);
line(300,267,300,300);

//ひげ
stroke(0);
line(150,230,210,250);
line(140,250,210,265);
line(140,275,210,280);

line(450,230,390,250);
line(460,250,390,265);
line(460,275,390,280);



//ふにゃ
stroke(0);
noFill();
arc(180,310,50,50,radians(60),radians(220));
arc(420,310,50,50,radians(320),radians(480));

//口上
stroke(0);
fill(255,155,138);
arc(300,500,400,400,radians(237),radians(303));

//口下
stroke(0);
fill(255,155,138);
arc(300,300,224,220,radians(20),radians(160));

//白かくし
noStroke();
fill(255);
arc(300,450,200,200,radians(180),radians(360));

//ドラやき茶
stroke(0);
fill(194,142,68);
ellipse(300,370,180,100);

//ドラやき黄色
noStroke();
fill(244,234,121);
ellipse(300,370,210,30);

//ドラやき線
stroke(0);
line(210,370,390,370);

//首輪
stroke(0);
fill(255,86,78);
rect(180,432,230,40);

//鈴
stroke(0);
fill(244,240,93);
ellipse(300,470,70,70);

//鈴線
stroke(0);
line(266,463,334,463);
line(266,473,334,473);
line(300,492,300,505);


//鈴影
stroke(0);
fill(245,208,30);
ellipse(300,485,15,15);

//腕
stroke(0);
fill(101,130,255);
ellipse(160,450,100,100);
ellipse(440,450,100,100);

//手
stroke(0);
fill(255);
ellipse(200,390,80,80);
ellipse(400,390,80,80);

//ハート
noStroke();
fill(255,166,208);
arc(520,220,50,50,radians(135),radians(405));
arc(570,220,50,50,radians(135),radians(405));
rect(502,217,86,20);
triangle(502,237,588,237,545,280);
