void setup() {
  size(500,500);
  smooth();
  background(255);
  strokeWeight(1);//線の太さ
  frameRate(30);
}

void draw() {
  
//***プロペラ始め  
 //プロペラ部（固定部品）
   fill(188,137,29);//着脱部と支柱、プロペラ取り付け部は黄色
   circle(178,63,30);//着脱部
   rect(173,30,8,20);//支柱
   ellipse(177,30, 17, 5);//プロペラ取り付け部
 //プロペラ部
   fill(197,197,197,1);//円内を半透明にして回転の線を見やすく
   //println(frameCount);//計算用

  if (frameCount  % 2 == 0) { //2で割って余りが0の時のyes/No

   //上の回転残像を記述
    stroke(1);//黒線にする
    line(153,25,137,29);//左外側
    line(163,25,147,29);//左中側
    line(173,25,157,29);//左内側   
    line(200,30,185,34);//右内側
    line(210,30,195,34);//右中側
    line(220,30,205,34);//右外側
    stroke(255);//すべて消す
   //下の回転残像を消去
    stroke(255);//白を上書きで消す
    ellipse(177,30, 100, 20);//外周消す
    line(155,25,139,31);//左外側消す
    line(165,27,149,31);//左中側消す
    line(175,27,159,31);//左内側消す 
    line(202,33,187,37);//右内側消す
    line(212,33,197,37);//右中側消す
    line(222,33,207,37);//右外側消す
  }
 else{
   //下の回転残像を記述
    stroke(127);
    ellipse(177,30, 100, 20);
    stroke(1);
    line(155,25,139,31);//左外側
    line(165,27,149,31);//左中側
    line(175,27,159,31);//左内側   
    line(202,33,187,37);//右内側
    line(212,33,197,37);//右中側
    line(222,33,207,37);//右外側
   //上の回転残像を消去
    stroke(255);//白で上書きで消す
    line(153,25,137,29);//左外側消す
    line(163,25,147,29);//左中側消す
    line(173,25,157,29);//左内側消す
    line(200,30,185,34);//右内側消す
    line(210,30,195,34);//右中側消す
    line(220,30,205,34);//右外側消す
 
  }

   stroke(0,0,0);//すべてを元に
   
//***プロペラ終わり
  
//顔
fill(87,163,199);
circle(177,175,234);//外側
//fill(255,255,255);
fill(235,235,235);
ellipse(178,193, 215, 195);//内側
noFill();
//bezier(293,165,282,212,282,212,242,260);//影

//影を作るために
beginShape();
 fill(0,0,0,50);//ちょっと黒っぽく半透明で影
 noStroke();//影だから線はいらない

 vertex(242,260);//下側影
 bezierVertex(246,260,250,260,256,259);
 vertex(256,259);//外側影
 bezierVertex(295,216,294,202,293,165);
 vertex(293,165);//内側影
 bezierVertex(282,226,273,230,242,260);

endShape();

stroke(0);//元の黒に戻す


//目
  fill(235,235,235);
  ellipse(157,99, 46, 60);//右目
  fill(63,64,66);
  ellipse(167,103, 12, 18);//右虹彩
  fill(255,255,255);
  ellipse(168,106, 7, 7);//右瞳孔
  
  fill(235,235,235);
  ellipse(203,99, 46, 60);//左目
  fill(63,64,66);
  ellipse(193,103, 12, 18);//左虹彩
  fill(255,255,255);
  ellipse(192,106, 7, 7);//左瞳孔


//鼻
  fill(188,69,89);
  circle(180,133,30);//外周
  fill(130,52,76);
  circle(183,138,15);//影
  fill(235,235,235);
  circle(175,128,12);//反射
  
  line(180,150,180,172);

//口
fill(126,48,72);
beginShape();

  vertex(98,184);//右上唇
  bezierVertex(124,180,157,172,184,172);//右上唇
  vertex(184,172);//左上唇
  bezierVertex(210,174,229,176,255,179);//左上唇
  vertex(255,179);
  bezierVertex(245,224,217,252,179,256);//左下唇
  vertex(179,256);
  bezierVertex(131,248,111,225,98,184);//右下唇

endShape();


//舌上
fill(164,78,81);
beginShape();
  vertex(130,235);//右上
  bezierVertex(127,207,147,200,179,216);//右上
  vertex(179,216);//左上
  bezierVertex(201,200,225,200,226,233);//左上
  vertex(226,233);//左下　隠れて見えない
  bezierVertex(202,261,156,262,130,236);//右下　隠れて見えない
endShape();
noFill();

//舌下
fill(206,102,91);
beginShape();
  vertex(130,235);//右上
  bezierVertex(144,212,156,209,179,223);//右上
  vertex(179,223);//左上
  bezierVertex(201,209,211,211,226,233);//左上
  
  vertex(226,233);//左下　隠れて見えない
  bezierVertex(202,261,156,262,130,236);//右下　隠れて見えない
endShape();
noFill();


//ヒゲ
line(79,114,137,130);//右上
line(69,152,136,153);//右中
line(73,184,137,167);//右下
line(218,132,272,110);//左上
line(222,150,285,146);//左中
line(222,160,284,177);//左下

bezier(113,144,107,127,85,130,78,151);//右巻きヒゲ上
bezier(78,151,73,173,88,177,98,184);//右巻きヒゲ下
bezier(238,140,267,126,273,142,275,150);//左巻きヒゲ上
bezier(275,150,275,150,283,177,255,179);//左巻きヒゲ下

//右腕
fill(88,164,200);
beginShape();
  vertex(98,273);
  bezierVertex(86,282,74,294,60,313);
  vertex(60,313);
  bezierVertex(66,324,76,327,83,336);
  vertex(83,336);
  bezierVertex(89,336,94,334,99,331);
  vertex(99,331);
  bezierVertex(109,316,121,290,100,273);
endShape();

//右腕影
fill(55,112,157);
noStroke();//影だから線要らない
beginShape();
  vertex(83,336);
  bezierVertex(89,336,94,334,99,331);
  vertex(99,331);
  bezierVertex(100,328,100,320,100,318);
  vertex(100,318);
  bezierVertex(93,324,87,330,81,336);
endShape();
stroke(0);//

fill(235,235,235);//手の灰色に
circle(62,335,42);//右手

//左腕
fill(88,164,200);
noStroke();////影だから線要らない
beginShape();
  vertex(257,259);
  bezierVertex(267,249,282,238,289,234);
  vertex(289,234);
  bezierVertex(303,237,306,242,309,258);
  vertex(309,258);
  bezierVertex(295,279,281,293,259,303);
  vertex(259,303);
  bezierVertex(250,295,250,277,257,259);
endShape();

//左腕影
fill(55,112,157);
//noStroke();//
beginShape();
  vertex(259,292);
  bezierVertex(272,293,277,290,298,273);
  vertex(298,273);
  bezierVertex(282,291,279,294,259,303);
  vertex(259,303);
  bezierVertex(259,298,259,295,259,292);
endShape();
stroke(0);//

fill(235,235,235);//手の灰色に
circle(313,235,45);//左手

//****************
//足
fill(235,235,235);
ellipse(132,402, 96, 40);//右足
ellipse(229,403, 96, 40);//左足
//****************

//******************胴体フレーム（枠線あり）
//体右
fill(87,163,199);
beginShape();
  //体右
  vertex(100,295);//
  bezierVertex(99,304,100,340,106,388);//
  //右下
  vertex(106,388);//
  bezierVertex(125,390,133,405,175,392);//
  //左下
  vertex(189,393);//
  bezierVertex(207,397,240,395,254,384);//左下
  //体左
  vertex(254,384);//
  bezierVertex(259,334,259,293,256,275);//
endShape();

//******************ここまで。胴体フレーム（枠線あり）

//******************胴体の色ぬり用（枠線なし）
fill(87,163,199);
beginShape();
noStroke();
  //体右
  vertex(103,275);//透明、塗装用
  bezierVertex(99,304,100,340,106,388);//透明、塗装用
  //右下
  vertex(106,388);//
  bezierVertex(125,390,133,405,175,392);//
  //左下
  vertex(189,393);//
  bezierVertex(207,397,240,395,254,384);//左下
  //体左
  vertex(254,384);//
  bezierVertex(259,334,259,293,256,275);//

endShape();
stroke(0,0,0);//元の黒線に戻して置く
//**********

//腹
fill(235,235,235);
beginShape();
  vertex(132,279);
  bezierVertex(100,345,137,370,182,374);
  vertex(182,374);
  bezierVertex(255,370,250,323,230,277);
endShape();

//ポケット
fill(235,235,235);
arc(182,314,100,100,radians(-2),radians(176));
line(133,317,231,312);

//首輪
fill(180,65,80);
beginShape();
  vertex(100,260);//上
  bezierVertex(152,267,208,265,256,259);//上
  line(256,259,257,274);//右側部
  vertex(257,274);//下左
  bezierVertex(239,277,239,277,204,279);//下左
  vertex(204,279);//下右
  bezierVertex(167,281,135,279,99,273);//下右
  line(99,273,100,260);//右側部
endShape();

//首輪の影
fill(0,0,0,50);
noStroke();//
beginShape();
  vertex(230,263);//斜め
  bezierVertex(234,266,240,270,243,276);//
  vertex(243,276);//下
  bezierVertex(247,276,251,275,257,274);//
  vertex(257,274);//横
  bezierVertex(257,269,256,265,256,259);//
  vertex(256,259);//上
  bezierVertex(249,261,241,262,230,263);//
endShape();
stroke(0,0,0);//


//鈴
fill(223,187,90);
circle(186,283,36);
noFill();
arc(190,325,100,100,radians(245),radians(286));//上
arc(190,330,100,100,radians(245),radians(286));//下
fill(130,113,59);
circle(186,288,10);//鈴の穴
noFill();
line(186,293,186,301);

//右足影
noStroke();//影だから線なし
fill(55,112,157);
ellipse(178,390, 20, 15);//右足影

//股
stroke(0);
fill(255,255,255);
ellipse(181,393, 14, 20);//股の空白

//左足影
noStroke();//影だから線なし
fill(55,112,157);
triangle(178,383,199,383,190,393);//左足影

}
